OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf18345.h
extern __at(0x061C) volatile __PWM6CONbits_t PWM6CONbits;

#define _PWM6POL                0x10
#define _PWM6OUT                0x20
#define _PWM6EN                 0x80

//==============================================================================


//==============================================================================
//        PWM6CON0 Bits

extern __at(0x061C) __sfr PWM6CON0;

typedef struct
  {
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned PWM6POL              : 1;
  unsigned PWM6OUT              : 1;
  unsigned                      : 1;
  unsigned PWM6EN               : 1;
  } __PWM6CON0bits_t;

extern __at(0x061C) volatile __PWM6CON0bits_t PWM6CON0bits;

#define _PWM6CON0_PWM6POL       0x10
#define _PWM6CON0_PWM6OUT       0x20
#define _PWM6CON0_PWM6EN        0x80

//==============================================================================


//==============================================================================
//        PWMTMRS Bits

extern __at(0x061F) __sfr PWMTMRS;

typedef union
  {
  struct
    {
    unsigned P5TSEL0            : 1;
    unsigned P5TSEL1            : 1;
    unsigned P6TSEL0            : 1;
    unsigned P6TSEL1            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned P5TSEL             : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 2;
    unsigned P6TSEL             : 2;
    unsigned                    : 4;
    };
  } __PWMTMRSbits_t;

extern __at(0x061F) volatile __PWMTMRSbits_t PWMTMRSbits;

#define _P5TSEL0                0x01
#define _P5TSEL1                0x02
#define _P6TSEL0                0x04
#define _P6TSEL1                0x08

//==============================================================================


//==============================================================================
//        CWG1CLKCON Bits

extern __at(0x0691) __sfr CWG1CLKCON;

typedef union
  {
  struct
    {
    unsigned CS                 : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CWG1CS             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __CWG1CLKCONbits_t;

extern __at(0x0691) volatile __CWG1CLKCONbits_t CWG1CLKCONbits;

#define _CS                     0x01
#define _CWG1CS                 0x01

//==============================================================================


//==============================================================================
//        CWG1DAT Bits

extern __at(0x0692) __sfr CWG1DAT;

typedef union
  {
  struct
    {
    unsigned CWG1DAT0           : 1;
    unsigned CWG1DAT1           : 1;
    unsigned CWG1DAT2           : 1;
    unsigned CWG1DAT3           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CWG1DAT            : 4;
    unsigned                    : 4;
    };
  } __CWG1DATbits_t;

extern __at(0x0692) volatile __CWG1DATbits_t CWG1DATbits;

#define _CWG1DAT0               0x01
#define _CWG1DAT1               0x02
#define _CWG1DAT2               0x04
#define _CWG1DAT3               0x08

//==============================================================================


//==============================================================================
//        CWG1DBR Bits

extern __at(0x0693) __sfr CWG1DBR;

typedef union
  {
  struct
    {
    unsigned DBR0               : 1;
    unsigned DBR1               : 1;
    unsigned DBR2               : 1;
    unsigned DBR3               : 1;
    unsigned DBR4               : 1;
    unsigned DBR5               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CWG1DBR0           : 1;
    unsigned CWG1DBR1           : 1;
    unsigned CWG1DBR2           : 1;
    unsigned CWG1DBR3           : 1;
    unsigned CWG1DBR4           : 1;
    unsigned CWG1DBR5           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned DBR                : 6;
    unsigned                    : 2;
    };

  struct
    {
    unsigned CWG1DBR            : 6;
    unsigned                    : 2;
    };
  } __CWG1DBRbits_t;

extern __at(0x0693) volatile __CWG1DBRbits_t CWG1DBRbits;

#define _DBR0                   0x01
#define _CWG1DBR0               0x01
#define _DBR1                   0x02
#define _CWG1DBR1               0x02
#define _DBR2                   0x04
#define _CWG1DBR2               0x04
#define _DBR3                   0x08
#define _CWG1DBR3               0x08
#define _DBR4                   0x10
#define _CWG1DBR4               0x10
#define _DBR5                   0x20
#define _CWG1DBR5               0x20

//==============================================================================


//==============================================================================
//        CWG1DBF Bits

extern __at(0x0694) __sfr CWG1DBF;

typedef union
  {
  struct
    {
    unsigned DBF0               : 1;
    unsigned DBF1               : 1;
    unsigned DBF2               : 1;
    unsigned DBF3               : 1;
    unsigned DBF4               : 1;
    unsigned DBF5               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CWG1DBF0           : 1;
    unsigned CWG1DBF1           : 1;
    unsigned CWG1DBF2           : 1;
    unsigned CWG1DBF3           : 1;
    unsigned CWG1DBF4           : 1;
    unsigned CWG1DBF5           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CWG1DBF            : 6;
    unsigned                    : 2;
    };

  struct
    {
    unsigned DBF                : 6;
    unsigned                    : 2;
    };
  } __CWG1DBFbits_t;

